lib/tasks/articles.rake

  task cleanup: :environment do
    Article.where(
      "reports_count >= ?",
      6
    ).destroy_all
---
SELECT "articles".* FROM "articles" WHERE (reports_count >= 6)