app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."archived" = FALSE
---
  def index
    @articles = Article.where(archived: false)

INSERT INTO "articles" ("title", "body", "reports_count", "archived", "user_id", "created_at", "updated_at") VALUES ('test', 'test', NULL, NULL, 3, '2026-06-08 09:55:28.925098', '2026-06-08 09:55:28.925098') RETURNING "id"
---
  def create
    @article = Current.user.articles.build(article_params)

    if @article.save

UPDATE "articles" SET "updated_at" = '2026-06-08 10:55:32.234393' WHERE "articles"."id" = 2
---
  def update
    if @article.update(article_params)