app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "created_at", "updated_at") VALUES ('test', '2026-06-08 08:58:40.099722', '2026-06-08 08:58:40.099722') RETURNING "id"

  def update
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1

  def destroy
    @product = Product.find(params[:id])

    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = 4 LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 4