app/controllers/registrations_controller.rb

INSERT INTO "users" ("email_address", "password_digest", "created_at", "updated_at") VALUES ('test@test.test', '$2a$12$JvdJelkYnETdlh7Zn45v/.SgN9HEekPMShEsF25v7cu2zaNEFCd0a', '2026-06-08 09:52:55.941089', '2026-06-08 09:52:55.941089') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save